/****************************************************************************
* Copyright (c) 2013 Intel Corporation
*
* Licensed under the Apache License, Version 2.0 (the "License");
* you may not use this file except in compliance with the License.
* You may obtain a copy of the License at
*
*     http://www.apache.org/licenses/LICENSE-2.0

* Unless required by applicable law or agreed to in writing, software
* distributed under the License is distributed on an "AS IS" BASIS,
* WITHOUT WARRANTIES OR CONDITIONS OF ANY KIND, either express or implied.
* See the License for the specific language governing permissions and
* limitations under the License.
****************************************************************************/

/****************************************************************************
* INTEL CONFIDENTIAL
* Copyright 2001-2013 Intel Corporation All Rights Reserved.
*
* The source code contained or described herein and all documents related to
* the source code ("Material") are owned by Intel Corporation or its
* suppliers or licensors.  Title to the Material remains with Intel
* Corporation or its suppliers and licensors.  The Material contains trade
* secrets and proprietary and confidential information of Intel or its
* suppliers and licensors.  The Material is protected by worldwide copyright
* and trade secret laws and treaty provisions.  No part of the Material may
* be used, copied, reproduced, modified, published, uploaded, posted,
* transmitted, distributed, or disclosed in any way without Intel's prior
* express written permission.
*
* No license under any patent, copyright, trade secret or other intellectual
* property right is granted to or conferred upon you by disclosure or
* delivery of the Materials, either expressly, by implication, inducement,
* estoppel or otherwise.  Any license under such intellectual property rights
* must be express and approved by Intel in writing.
****************************************************************************/

#include "vmm_defs.h"
#include "guest_cpu.h"
#include "isr.h"
#include "vmx_vmcs.h"
#include "guest_cpu_vmenter_event.h"
#include "host_memory_manager_api.h"

/////////////////////////////////////////////////////////////////////////////
// This is 32-bit TSS.

#pragma pack(1)
typedef struct {
    UINT32  prev_tr;            // 0
    UINT32  esp0;               // 4
    UINT32  ss0;                // 8
    UINT32  esp1;               // 12
    UINT32  ss1;                // 16
    UINT32  esp2;               // 20
    UINT32  ss2;                // 24
    UINT32  cr3;                // 28
    UINT32  eip;                // 32
    UINT32  eflags;             // 36
    UINT32  eax;                // 40
    UINT32  ecx;                // 44
    UINT32  edx;                // 48
    UINT32  ebx;                // 52
    UINT32  esp;                // 56
    UINT32  ebp;                // 60
    UINT32  esi;                // 64
    UINT32  edi;                // 68
    UINT32  es;                 // 72
    UINT32  cs;                 // 76
    UINT32  ss;                 // 80
    UINT32  ds;                 // 84
    UINT32  fs;                 // 88
    UINT32  gs;                 // 92
    UINT32  ldtr;               // 96
    UINT32  io_base_addr;       // 100
} tss32_t;
#pragma pack()

/////////////////////////////////////////////////////////////////////////////
// Only three 32-bit registers are used during task switch.  They are not to
// be shared with VMM.  VMM works with 64-bit values.

typedef union {
    UINT32 value;
    struct {
        UINT32 carry:1;
        UINT32 rsvd_1:1;
        UINT32 parity:1;
        UINT32 rsvd_3:1;
        UINT32 adjust:1;
        UINT32 rsvd_5:1;
        UINT32 zero:1;
        UINT32 sign:1;
        UINT32 trap:1;
        UINT32 intr_enable:1;
        UINT32 direction:1;
        UINT32 overflow:1;
        UINT32 iopl:2;
        UINT32 nested_task:1;
        UINT32 rsvd_15:1;
        UINT32 resume:1;
        UINT32 v86_mode:1;
        UINT32 align_chk:1;
        UINT32 v_intr:1;
        UINT32 v_intr_pend:1;
        UINT32 ident:1;
        UINT32 rsvd_31_22:10;
    } bits;
} eflags_t;

typedef union {
    UINT32 value;
    struct {
